arr1 = ['Автомобили (ином.)',
'Автомобили (отеч.)',
'Запчасти',
'Гаражи',
'Другое']

arr2 = ['Прочие']

arr3 = ['Аудио',
'Видео',
'Фото',
'Кассеты и СD',
'Другое']

arr4 = ['Кондиционеры',
'Отопление',
'Стиральные машины',
'Холодильники',
'Другое']

arr5 = ['Кошки',
'Собаки',
'Рыбы',
'Птицы',
'Другое',
'Услуги']

arr6 = ['Он',
'Она',
'Услуги']

arr7 = ['Видеокарты',
'Винчестеры',
'Компьютеры',
'Ноутбуки',
'Модемы',
'Мат. платы',
'Мониторы',
'Мультимедиа',
'Память',
'Принтеры',
'Программное обеспечение',
'Процессоры',
'Сетевое оборудование',
'CD-ROM и т.д.',
'Системные блоки',
'Сканеры',
'Другое']

arr8 = ['Для детской',
'Для кухни',
'Для спальни',
'Для офиса',
'Другое']

arr9 = ['Дача',
'Дом',
'Другое',
'Квартира',
'Комната',
'Офис',
'Помещение',
'Садовый участок',
'Склад']

arr10 = ['Одежда',
'Обувь']

arr11 = ['вино-водочная продукция',
'кондитерские изделия',
'молочные изделия',
'фрукты, овощи',
'крупа, мука',
'мясо',
'рыбы',
'детское питание',
'другое']

arr12 = ['Текстильное',
'Нефтепереработка',
'Химическое',
'Другое']

arr13 = ['Разовая',
'По совместительству',
'Временная',
'Постоянная']

arr14 = ['Разное']

arr15 = ['Спорт товары',
'Туристические товары',
'Охота',
'Рыбалка',
'Товары для отдыха',
'Услуги',
'Другое']

arr16 = ['Мобильные',
'Радиотелефоны',
'Факсы',
'Пейджер',
'Другое']

arr17 = ['Сантехника',
'Отделочные материалы',
'Стройматериалы',
'Строительные услуги']

arr18 = ['Посреднические',
'Ремонтные',
'Юридические',
'Другие']


category_hash = { 'Авторынок' => arr1,
'Анонсы (Новости)' => arr2,
'Аудио, видео, фототехника' => arr3,
'Бытовая техника' => arr4,
'Животные' => arr5,
'Знакомство' => arr6,
'Компьютеры' => arr7,
'Мебель' => arr8,
'Недвижимость' => arr9,
'Одежда и обувь' => arr10,
'Продукты питания' => arr11,
'Промышленные товары' => arr12,
'Работа' => arr12,
'Разное' => arr14,
'Спорт, туризм, отдых' => arr15,
'Средства связи' => arr16,
'Строительство, ремонт, отделка' => arr17,
'Услуги' => arr18 }

category_hash.each { |key, value|

	@cat = Category.create( name: key )
	value.each { |subcat|
		Category.create( name: subcat, category_id: @cat.id )
	}
}

arr = []
Category.all.each {|ctg|
	if ctg.category_id !=nil
		arr << ctg.id
	end
}

i = 5
INPUT_FILENAME  = Rails.root.join("db/r_reflex.txt")
BLOCK_SIZE = 400
domain = ['.ru', '.com', '.org', '.net', '.gov']
service = ['@mail', '@google', '@yahoo', '@yandex']
File.open(INPUT_FILENAME) { |f|
  while i != 0
  	content = f.read(BLOCK_SIZE)
  	email = SecureRandom.hex(4) + service.sample + domain.sample
	phone = rand((1000000..99999999999)).to_s
	icq = rand((1000000..99999999999)).to_s
	skype  = SecureRandom.hex(4)
	name = ('a'..'z').to_a.shuffle[0..(7..11).to_a.sample].join.capitalize
	Advert.create( content: content, email: email, phone: phone, icq: icq, skype: skype, name: name,
		category_id: arr.sample )
	i -= 1
  end
}
